Revit 2026 API

# FieldDomainPointsByUV(IListUV, ICollectionDouble, ICollectionDouble) Constructor

---

Initializes a new instance of the FieldDomainPointsByUV class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldDomainPointsByUV(
	IList<UV> points,
	ICollection<double> uCoordinates,
	ICollection<double> vCoordinates
)
```
```vb
Public Sub New (
	points As IList(Of UV),
	uCoordinates As ICollection(Of Double),
	vCoordinates As ICollection(Of Double)
)
```
```cpp
public:
FieldDomainPointsByUV(
	IList<UV^>^ points,
	ICollection<double>^ uCoordinates,
	ICollection<double>^ vCoordinates
)
```
```fsharp
new :
        points : IList<UV> *
        uCoordinates : ICollection<float> *
        vCoordinates : ICollection<float> -> FieldDomainPointsByUV
```

#### Parameters

points IListUV

uCoordinates ICollectionDouble

vCoordinates ICollectionDouble

#### Reference

FieldDomainPointsByUV Class

FieldDomainPointsByUV Overload

Autodesk.Revit.DB.Analysis Namespace